shanemmattner/embedded-agent-bridge/examples/esp32c6-apptrace-test/sdkconfig.defaults
# Minimal config for ESP32-C6
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# USB Serial/JTAG console (for regular debug output)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Application trace via JTAG (for high-speed streaming)
CONFIG_APPTRACE_DEST_JTAG=y
CONFIG_APPTRACE_ENABLE=y
